Repository: moldovanedy/ShopManager
Catalog: ShopManager.Resources/Locale/Messages.*.resx
Languages: ro

# FATAL_ERROR_TITLE
source: Fatal error!
ro: Eroare fatală!

# FATAL_ERROR_TEXT
source: Fatal error. Any unsaved changes are lost.
ro: Eroare fatală. Toate modificările nesalvate au fost pierdute.

# SAVE_CHANGES_QUESTION_TEXT
source: There are unsaved changes. Do you want to save your changes?
ro: Există modificări nesalvate. Dorești să salvezi modificările?

# SAVE_CHANGES_QUESTION_TITLE
source: Save changes?
ro: Salvezi modificările?

# UNEXPECTED_ERROR_TITLE
source: Unexpected error
ro: Eroare neașteptată

# UNEXPECTED_ERROR_TEXT
source: An unexpected error occurred.
ro: A apărut o eroare neașteptată.

# ABOUT_APP_DESCRIPTION
source: A simple manager for a physical shop/store. Handles product information and sales history.
ro: Un manager simplu pentru magazine fizice. Gestionează informații despre produse și istoricul vânzărilor.

# ABOUT_APP_TITLE
source: Shop manager
ro: Manager magazin

# DISCARD_CHANGES_TEXT
source: Disacrd all unsaved changes? Any unsaved changes will be lost if you discard the changes.
ro: Renunți la toate modificările nesalvate? Toate modificările nesalvate se vor pierde dacă renunți la ele.

# DISCARD_CHANGES_TITLE
source: Discard all unsaved changes?
ro: Renunți la toate modificările nesalvate?

# UPDATE_STOCK_QUESTION_TEXT
source: Would you like to update the product stock (Quantity) as well to reflect the sales changes?
ro: Ai vrea să modifici, de asemenea, stocul produsului (Cantitate) pentru a reflecta schimbările din vânzări?

# UPDATE_STOCK_QUESTION_TITLE
source: Update stock as well?
ro: Modifici și stocul?

# WARN_SALE_OUT_OF_STOCK_TEXT
source: The given quantity is larger than the selected product's stock (Quantity). This will result in a negative stock, which is nonsensical. Make sure this is the right quantity. Do you still want to update the stock?
ro: Cantitatea dată este mai mare decât stocul produsului selectat. Asta va rezulta în cantitate (stoc) negativă, ceea ce nu are sens. Asigură-te că aceasta este cantitatea corectă. Vrei totuși să actualizezi stocul în aceste condiții?

# WARN_SALE_OUT_OF_STOCK_TITLE
source: Quantity larger than stock!
ro: Cantitate mai mare decât stocul existent

# DEPENDENT_PRODUCTS_ERROR_TEXT
source: There are products that belong in the category named "{0}". You can not delete the category until there are no more products using this category.
ro: Există produse care aparțin categoriei "{0}". Nu poți șterge categoria până când nu mai există nici un produs care să aparțină acestei categorii.

# DEPENDENT_PRODUCTS_ERROR_TITLE
source: Dependent products found!
ro: S-au găsit produse dependente!

# DEPENDENT_SALES_ERROR_TEXT
source: There are sales that are bound to the product named "{0}". You can not delete the product until there are no more sales bound to this product.
ro: Există vânzări care sunt legate de produsul "{0}". Nu poți șterge produsul până când nu mai există nici o vânzare care să fie legată de acest produs.

# DEPENDENT_SALES_ERROR_TITLE
source: Dependent sales found!
ro: S-au găsit vânzări dependente!

# CATEGORY_SAVE_NEEDED_TEXT
source: You need to save the changes before adding a category with the same name as one of the deleted categories.
ro: Trebuie să salvezi modificările înainte de a adăuga o categorie cu același nume

# CATEGORY_SAVE_NEEDED_TITLE
source: Save needed
ro: Este necesară salvarea

# VALIDATION_CATEGORY_NAME_EMPTY
source: The category name cannot be empty!
ro: Numele categoriei nu poate fi gol!

# VALIDATION_ERROR_TITLE
source: Input data error
ro: Eroare date intrare

# VALIDATION_MULTIPLE_CATEGORIES_SELECTED_TEXT
source: You can't update multiple categories at once. Select only one.
ro: Nu poți modifica mai multe categorii simultan. Selectează o singură categorie.

# VALIDATION_MULTIPLE_CATEGORIES_SELECTED_TITLE
source: Multiple categories selected
ro: Categorii multiple selectate

# VALIDATION_SALE_PRODUCT_NAME_EMPTY
source: The name of the product cannot be empty!
ro: Numele produsului nu poate fi gol!

# VALIDATION_SALE_QUANTITY_EMPTY
source: The quantity can't be empty or negative!
ro: Cantitatea nu poate fi goală sau negativă!
